RESULT = {
  "start_address": "Ben Yehuda 86 Tel Aviv",
  "end_address": "Ben Yehuda 2 Tel Aviv",
  "start_coordinates": [
    34.765864,
    32.077317
  ],
  "end_coordinates": [
    34.787418,
    32.070455
  ],
  "total_routes": 2,
  "routes": [
    {
      "route_index": 0,
      "distance_meters": 882.48,
      "distance_km": 0.88,
      "duration_seconds": 605.795,
      "duration_minutes": 10.1,
      "safety_rank": 9,
      "safety_description": "",
      "geometry": {
        "coordinates": [
          [
            34.7665731,
            32.0775525
          ],
          [
            34.7666275,
            32.0775895
          ],
          [
            34.7666716,
            32.0775779
          ],
          [
            34.7669526,
            32.0779422
          ],
          [
            34.7670827,
            32.0778822
          ],
          [
            34.7673262,
            32.0779891
          ],
          [
            34.7675586,
            32.0780789
          ],
          [
            34.7675742,
            32.0780598
          ],
          [
            34.768447,
            32.0776242
          ],
          [
            34.7689092,
            32.0773845
          ],
          [
            34.769574,
            32.0770392
          ],
          [
            34.7700552,
            32.0767773
          ],
          [
            34.7707213,
            32.0764336
          ],
          [
            34.7713111,
            32.0761243
          ],
          [
            34.771762,
            32.0758949
          ],
          [
            34.772481,
            32.075536
          ],
          [
            34.7731564,
            32.0751882
          ],
          [
            34.7734498,
            32.0750404
          ],
          [
            34.7735318,
            32.074999
          ],
          [
            34.774172,
            32.0746565
          ],
          [
            34.7747838,
            32.0743304
          ],
          [
            34.7753065,
            32.0740738
          ],
          [
            34.7753451,
            32.074061
          ],
          [
            34.7754061,
            32.0740479
          ],
          [
            34.7754434,
            32.0740356
          ],
          [
            34.7758518,
            32.0738309
          ],
          [
            34.7764177,
            32.0735368
          ],
          [
            34.7769064,
            32.0732828
          ],
          [
            34.7770707,
            32.0731974
          ],
          [
            34.7778173,
            32.0728229
          ],
          [
            34.7784649,
            32.0724964
          ],
          [
            34.7785027,
            32.0724791
          ],
          [
            34.778536,
            32.0724644
          ],
          [
            34.7785708,
            32.0724467
          ],
          [
            34.7786812,
            32.0723953
          ],
          [
            34.7793201,
            32.072079
          ],
          [
            34.7794875,
            32.0719821
          ],
          [
            34.7798936,
            32.0717538
          ],
          [
            34.7799974,
            32.0716878
          ],
          [
            34.7808185,
            32.0714067
          ],
          [
            34.7806291,
            32.0709549
          ],
          [
            34.7816314,
            32.0706704
          ]
        ],
        "type": "LineString"
      },
      "steps": [
        {
          "instruction": "Walk northeast on בן יהודה.",
          "distance_meters": 715.505,
          "duration_seconds": 482.996,
          "street_name": "בן יהודה"
        },
        {
          "instruction": "Bear left to stay on בן יהודה.",
          "distance_meters": 150.764,
          "duration_seconds": 109.889,
          "street_name": "בן יהודה"
        },
        {
          "instruction": "Turn left onto the walkway.",
          "distance_meters": 16.211,
          "duration_seconds": 12.91,
          "street_name": ""
        },
        {
          "instruction": "Your destination is on the right.",
          "distance_meters": 0,
          "duration_seconds": 0,
          "street_name": ""
        }
      ]
    },
        {
      "route_index": 0,
      "distance_meters": 882.48,
      "distance_km": 0.88,
      "duration_seconds": 605.795,
      "duration_minutes": 10.1,
      "safety_rank": 2  ,
      "safety_description": "",
      "geometry": {
        "coordinates": [
          [
            34.7665731,
            32.0775525
          ],
          [
            34.7658819,
            32.0755832
          ],
          [
            34.7658535,
            32.0754992
          ],
          [
            34.7666416,
            32.0754978
          ],
          [
            34.7680594,
            32.0754268
          ],
          [
            34.7686131,
            32.0753837
          ],
          [
            34.7687261,
            32.0753382
          ],
          [
            34.7697169,
            32.0752439
          ],
          [
            34.7709028,
            32.0749849
          ],
          [
            34.7706666,
            32.0747377
          ],
          [
            34.7719159,
            32.0739963
          ],
          [
            34.7714518,
            32.0736364
          ],
          [
            34.7718234,
            32.0731728
          ],
          [
            34.7720317,
            32.073335
          ],
          [
            34.7727765,
            32.072668
          ],
          [
            34.7729409,
            32.0725382
          ],
          [
            34.7734247,
            32.0725206
          ],
          [
            34.7738036,
            32.0721949
          ],
          [
            34.7737315,
            32.0721409
          ],
          [
            34.7737756,
            32.0721029
          ],
          [
            34.7749543,
            32.0716372
          ],
          [
            34.7764046,
            32.0711556
          ],
          [
            34.7779287,
            32.0707103
          ],
          [
            34.7786441,
            32.0705524
          ],
          [
            34.7787446,
            32.0705344
          ],
          [
            34.7802817,
            32.0701269
          ],
          [
            34.7804615,
            32.0705554
          ],
          [
            34.7806291,
            32.0709549
          ],
          [
            34.7816314,
            32.0706704
          ]
        ],
        "type": "LineString"
      },
      "steps": [
        {
          "instruction": "Walk northeast on בן יהודה.",
          "distance_meters": 715.505,
          "duration_seconds": 482.996,
          "street_name": "בן יהודה"
        },
        {
          "instruction": "Bear left to stay on בן יהודה.",
          "distance_meters": 150.764,
          "duration_seconds": 109.889,
          "street_name": "בן יהודה"
        },
        {
          "instruction": "Turn left onto the walkway.",
          "distance_meters": 16.211,
          "duration_seconds": 12.91,
          "street_name": ""
        },
        {
          "instruction": "Your destination is on the right.",
          "distance_meters": 0,
          "duration_seconds": 0,
          "street_name": ""
        }
      ]
    }
  ]
}





